#Python数据类型
#Number（数字）、String（字符串）、List（列表）、Tuple（元组）、Set（集合）、Dictionary（字典）
#其中，数字、字符串、元组为不可变数据类型，列表、集合、字典为可变数据类型
print('----------------------------------------------------------------------------')
#数字类型
print('--------------------------------数字类型学习----------------------------------')
#内置的 type() 函数可以用来查询变量所指的对象类型
#此外还可以用 isinstance 来判断,isinstance(变量名,要判断的数据类型)
a=1.7
print(type(a),'\n',isinstance(a,bool),'\n',isinstance(a,int),'\n',isinstance(a,complex),'\n',isinstance(a,float))
#赋值语句
b=2;c='python';d=1+2j
b0,c0,d0=2,'python',1+2j
print(b,c,d)
print(b0,c0,d0)
#del 删除对象
del b0,c0,d0
#此时输出b0会显示b0没有被定义
#print(b0,c0,d0)
print('----------------------------------------------------------------------------')
#List(列表)数据类型
print('----------------------------------List 学习----------------------------------')
#列表写在方括号 [] 里，元素之间用逗号隔开,列表的元素可以是各种数字类型
#索引值与字符串一样，从左到右 0 开始，从右到左 -1 开始
list1=['this','is','my']
#        0      1    2
list2=['python','folder']
#          0        1
print(list1,list2)
print(list1[0])
print(list1[0:2])
print(list1[0:3:2])
print(list1*2)
print(list1+list2)
#列表为可变数据类型,可以通过给对应位置复制的方式改变对应位置,赋值语句为list[*]=*
l=[1,2,3,4,5,6]
print(l)
l[0]=2
print(l)
l[0:3]=[3,1,2]
print(l)
l[0:6:2]=[5,1,3]
print(l)
print('----------------------------------------------------------------------------')





